export const NAMES = {
  botName: 'GPT-bot-Wiederholung',
  send_fn: 'Send-FN',
  api: 'GPT-bot-Wiederholung-api',
  DBname: 'GPT_Bot_Users',
};

export const TEXT = {
  NO_ACCESS: 'У вас не має доступу, почекайте поки вам нададуть доступ',
  NO_ACCESS_ACTION: 'У вас не має доступу для виконання ціеї операції',
  NO_ACCESS_ADD: 'Лише адміністратор може додавати користувачів',
  SUCCESSFUL_ADD: 'Тепер ви можете користуватися чатом',
  ERROR: 'Виникла помилка',
  SYSTEM_QUERY:
    'Ти допомагаєш мені вивчити Німецьку мову, та покращити мої знання до рівня B2',
  QUERY: `1. Надати значення слова німецькою та українською мовами.
2. Якщо це дієслово, надай інфінітив, Partizip II і вкажи, чи зворотне.
3. Дай 5 прикладів речень з перекладом на загальну тему. Дай 5 прикладів речень з перекладом на тему пов'язану з роботою. 
Та 5 прикладів речень з перекладом якщо була надано дієслово, щоб воно було в різних формах (Präteritum, Perfekt, Partizip II, Konjunktiv 2)  
4. Напиши пояснення цього слова німецькою рівнем B2.
5. Надай синоніми та антоніми.
6. Якщо можливо, вкажи утворені слова (іменник, прикметник тощо) з коротким поясненням.
7. Якщо є поширені фразеологізми та ідіоми пов'язані з цим словом - напиши їх та коротко поясни.`,
  QUERY_SATZ: `1. Надай переклад речення на українську мову.
2. Поясни значення кожного слова окремо, вкажи його частину мови (іменник, дієслово, прикметник тощо) і граматичну форму (відмінок, число, рід).
3. Поясни граматичну структуру речення:
   - Вкажи суб'єкт і об'єкт речення.
   - Поясни, у яких відмінках (Nominativ, Akkusativ, Dativ, Genitiv) стоять слова.
   - Вкажи, як узгоджуються дієслова з підметом і додатком.
4. Якщо можливо, надай граматично правильну версію речення (у разі помилок або можливих покращень).
5. Якщо є складні граматичні елементи (наприклад, підрядні речення або модальні дієслова), надай детальне пояснення їхнього вживання.`,
  TRANSLATE_QUERY:
    'Переклади на німецьку мову та надай коротке пояснення чому так перекладається',
  WRONG_LANG_QUERY: `Помилка запиту підтримуються такі: 'de', 'uk', 'ru'.
	Приклад встановлення мови введіть '/lang uk'`,
  LIST_QUERY: `Я надішлю тобі масив німецьких слів, мені потрібна відповідь у такому вилляді:
	**Слово1**: переклад на українську,
	**Слово2**: переклад на українську`,
  IMAGE_QUERY: `Опиши в 10 реченнях на німецькій мові картинку, опис надай рівнем мови B1, на надай переклад опису українською`,
  INFO: `Це бот для допомоги вивчення Німецької мови.
	Введіть слово або речення німецькою мовою і отримаєте пояснення.
'/list' - Показує список користувачів;
'/пер' - Перекладає слово або речення на німецьку мову;
'/запит' - Працює як звичайний чат GPT;
'/lang' - Встановлює мову транскрипції, доступні такі мови: 'de', 'uk', 'ru'. Для транскрипції просто відправте голосове повідомлення;
'/save' - зберегти слово;
'/getlist' - отримати список збережених слів`,
};
